ERM/src/Catalogs/КостЦентры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>КостЦентры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Segment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DefaultActivity</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OnlyMS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TaxRegistration</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NonLawson</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ERM/src/Enums/ТипыСоответствий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыСоответствий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Lawson</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OracleSmith</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OracleMI</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HOBs</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьCRM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьParentClients</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Sun</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ERM/src/Catalogs/КостЦентры/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура SubSegmentНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Прежде, чем выбирать саб сегмент - нужно выбрать сегмент
	Если НЕ ЗначениеЗаполнено(Объект.Segment) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"""Segment"" is empty!",
			, "Segment", "Объект");
			
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура SubSubSegmentНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Прежде, чем выбирать саб саб сегмент нужно выбрать саб сегмент кроме OracleSmith
	Если НЕ ЗначениеЗаполнено(Объект.SubSegment) И НЕ Объект.Source = ПредопределенноеЗначение("Перечисление.ТипыСоответствий.OracleSmith") Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"""Sub segment"" is empty!",
			, "SubSegment", "Объект");
			
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры
